cf/Documents/SupplierInvoice.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>SupplierInvoice</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Purchases</xr:Item>
				<xr:Item>AccumulationRegister.SupplierBalance</xr:Item>
				<xr:Item>AccumulationRegister.InventoryInWarehouses</xr:Item>
				<xr:Item>AccumulationRegister.InventoryCost</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Supplier</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Warehouse</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Warehouses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Multiplier</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Total</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExemptFromVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Product</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATRate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Total</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdvanceClearing</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.BankPayment</v8:Type>
								<v8:Type>cfg:DocumentRef.CashVoucher</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountCur</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Comment>Property</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Comment>Value</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/SupplierInvoice/Forms/DocumentForm/Ext/Form/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	PresentationCurrency = JetServer.GetPresentationCurrency();
	
	// StandardSubsystems.AttachableCommands
	AttachableCommands.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
	// StandardSubsystems.Properties
	AdditionalParameters = New Structure;
	AdditionalParameters.Insert("ItemForPlacementName", "GroupAdditionalAttributes");
	PropertyManager.OnCreateAtServer(ThisObject, AdditionalParameters);
	// End StandardSubsystems.Properties
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClientServer.UpdateCommands(ThisObject, Object);
	// End StandardSubsystems.AttachableCommands
	
	// StandardSubsystems.Properties
	PropertyManager.OnReadAtServer(ThisObject, CurrentObject);
	// End StandardSubsystems.Properties
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	FormManagement();
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClient.StartCommandUpdate(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
	// StandardSubsystems.Properties
	PropertyManagerClient.AfterImportAdditionalAttributes(ThisObject);
	// End StandardSubsystems.Properties
	
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClient.AfterWrite(ThisObject, Object, WriteParameters);
	// End StandardSubsystems.AttachableCommands
	
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	// StandardSubsystems.Properties
	If PropertyManagerClient.ProcessNotifications(ThisObject, EventName, Parameter) Then
		UpdateAdditionalAttributesItems();
		PropertyManagerClient.AfterImportAdditionalAttributes(ThisObject);
	EndIf;
	// End StandardSubsystems.Properties
	
EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer(Cancel, CheckedAttributes)
	
	If Object.Inventory.Total("Total") < Object.AdvanceClearing.Total("AmountCur") Then
		MessageText = NStr("en = 'The invoice amount is less than the clearing amount.'; tr = 'Fatura tutarı, mahsup tutarından düşük.'");
		Common.MessageToUser(MessageText,,,, Cancel);
	EndIf;
	
	// StandardSubsystems.Properties
	PropertyManager.FillCheckProcessing(ThisObject, Cancel, CheckedAttributes);
	// End StandardSubsystems.Properties
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	// StandardSubsystems.Properties
	PropertyManager.BeforeWriteAtServer(ThisObject, CurrentObject);
	// End StandardSubsystems.Properties
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure CurrencyOnChange(Item)
	
	DataStructure = New Structure;
	DataStructure.Insert("Currency", Object.Currency);
	DataStructure.Insert("PresentationCurrency", PresentationCurrency);
	DataStructure.Insert("Date", Object.Date);
	
	GetExchangeRateData(DataStructure);
	FillPropertyValues(Object, DataStructure, "ExchangeRate, Multiplier");
	
	FormManagement();
	
EndProcedure

&AtClient
Procedure ExemptFromVATOnChange(Item)
	
	FillVATRateByVATExemption();
	FormManagement();
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersInventory

&AtClient
Procedure InventoryProductOnChange(Item)
	
	CurrentData = Items.Inventory.CurrentData;
	
	DataStructure = New Structure;
	DataStructure.Insert("Product", CurrentData.Product);
	DataStructure.Insert("ExemptFromVAT", Object.ExemptFromVAT);
	
	GetProductData(DataStructure);
	
	FillPropertyValues(CurrentData, DataStructure);
	
	InventoryTabularSectionClientServer.CalculateAmount(CurrentData);
	
EndProcedure

&AtClient
Procedure InventoryQuantityOnChange(Item)
	
	InventoryTabularSectionClientServer.CalculateAmount(Items.Inventory.CurrentData);
	
EndProcedure

&AtClient
Procedure InventoryPriceOnChange(Item)
	
	InventoryTabularSectionClientServer.CalculateAmount(Items.Inventory.CurrentData);
	
EndProcedure

&AtClient
Procedure InventoryAmountOnChange(Item)
	
	TabSectionRow = Items.Inventory.CurrentData;
	
	If TabSectionRow.Quantity <> 0 Then
		TabSectionRow.Price = Round(TabSectionRow.Amount / TabSectionRow.Quantity, 2);
	EndIf;
	
	InventoryTabularSectionClientServer.CalculateVATAmountAndTotal(TabSectionRow);
	
EndProcedure

&AtClient
Procedure InventoryVATRateOnChange(Item)
	
	InventoryTabularSectionClientServer.CalculateVATAmountAndTotal(Items.Inventory.CurrentData);
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersAdvanceClearing

&AtClient
Procedure AdvanceClearingAmountOnChange(Item)
	
	CurrentData = Items.AdvanceClearing.CurrentData;
	If CurrentData <> Undefined Then
		CurrentData.AmountCur = JetClientServer.CalculateFromCurrencyToCurrency(CurrentData.Amount,
			1,
			1,
			Object.ExchangeRate,
			Object.Multiplier);
	EndIf;
	
EndProcedure

&AtClient
Procedure AdvanceClearingAmountCurOnChange(Item)
	
	CurrentData = Items.AdvanceClearing.CurrentData;
	If CurrentData <> Undefined Then
		CurrentData.Amount = JetClientServer.CalculateFromCurrencyToCurrency(CurrentData.AmountCur,
			Object.ExchangeRate,
			Object.Multiplier);
	EndIf;
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure SelectAdvances(Command)
	
	If Not ValueIsFilled(Object.Supplier) Then
		ShowMessageBox(, NStr("en = 'Please specify the supplier.'; tr = 'Lütfen tedarikçiyi belirtin.'"));
		Return;
	EndIf;
	
	AddressInStorage = PutAdvanceClearingToStorage();
	
	FormParameters = New Structure;
	FormParameters.Insert("AddressInStorage", AddressInStorage);
	FormParameters.Insert("InvoiceRef", Object.Ref);
	FormParameters.Insert("Counterparty", Object.Supplier);
	FormParameters.Insert("Currency", Object.Currency);
	FormParameters.Insert("ExchangeRate", Object.ExchangeRate);
	FormParameters.Insert("Multiplier", Object.Multiplier);
	FormParameters.Insert("InvoiceAmount", Object.Inventory.Total("Total"));
	FormParameters.Insert("IsCustomerAdvance", False);
	
	SelectAdvancesOnClose = New CallbackDescription("SelectAdvancesOnClose",
		ThisObject,
		New Structure("AddressInStorage", AddressInStorage));
	
	OpenForm("CommonForm.SelectAdvances", FormParameters,,,,, SelectAdvancesOnClose);
	
EndProcedure

// StandardSubsystems.ImportDataFromFile
&AtClient
Procedure ImportInventoryFromFile(Command)
	
	ImportParameters = ImportDataFromFileClient.DataImportParameters();
	ImportParameters.FullTabularSectionName = "SupplierInvoice.Inventory";
	ImportParameters.Title = NStr("en = 'Import inventory from file'; tr = 'Stoğu dosyadan içe aktar'");
	
	CallbackDescription = New CallbackDescription("ImportInventoryFromFileEnd", ThisObject);
	
	ImportDataFromFileClient.ShowImportForm(ImportParameters, CallbackDescription);
	
EndProcedure
// End StandardSubsystems.ImportDataFromFile

// StandardSubsystems.AttachableCommands
&AtClient
Procedure Attachable_ExecuteCommand(Command)
	AttachableCommandsClient.StartCommandExecution(ThisObject, Command, Object);
EndProcedure

&AtClient
Procedure Attachable_ContinueCommandExecutionAtServer(ExecutionParameters, AdditionalParameters) Export
	ExecuteCommandAtServer(ExecutionParameters);
EndProcedure

&AtServer
Procedure ExecuteCommandAtServer(ExecutionParameters)
	AttachableCommands.ExecuteCommand(ThisObject, ExecutionParameters, Object);
EndProcedure

&AtClient
Procedure Attachable_UpdateCommands()
	AttachableCommandsClientServer.UpdateCommands(ThisObject, Object);
EndProcedure
// End StandardSubsystems.AttachableCommands

// StandardSubsystems.Properties
&AtClient
Procedure Attachable_PropertiesExecuteCommand(ItemOrCommand, Var_URL = Undefined, StandardProcessing = Undefined)
	PropertyManagerClient.ExecuteCommand(ThisObject, ItemOrCommand, StandardProcessing);
EndProcedure
// End StandardSubsystems.Properties

#EndRegion

#Region Private

&AtServerNoContext
Procedure GetProductData(DataStructure)
	
	ProductAttributes = New Structure;
	ProductAttributes.Insert("VATRate", Catalogs.VATRates.EmptyRef());
	
	If ValueIsFilled(DataStructure.Product) Then
		ProductAttributes = Common.ObjectAttributesValues(DataStructure.Product, "VATRate");
	EndIf;
	
	If DataStructure.Property("ExemptFromVAT") And DataStructure.ExemptFromVAT Then
		DataStructure.Insert("VATRate", Catalogs.VATRates.GetExemptFromVATRate());
	Else
		DataStructure.Insert("VATRate", ProductAttributes.VATRate);
	EndIf;
	
	DataStructure.Insert("Quantity", 1);
	
EndProcedure

&AtServerNoContext
Procedure GetExchangeRateData(DataStructure)
	
	If ValueIsFilled(DataStructure.Currency) And DataStructure.Currency <> DataStructure.PresentationCurrency Then
		ExchRateStructure = CurrencyRateOperations.GetCurrencyRate(DataStructure.Currency, DataStructure.Date);
		DataStructure.Insert("ExchangeRate", ExchRateStructure.Rate);
		DataStructure.Insert("Multiplier", ExchRateStructure.Repetition);
	Else
		DataStructure.Insert("ExchangeRate", 1);
		DataStructure.Insert("Multiplier", 1);
	EndIf;
	
EndProcedure

&AtClient
Procedure FormManagement()
	
	If Object.Currency = PresentationCurrency Then
		Items.ExchangeRate.ReadOnly = True;
		Items.Multiplier.ReadOnly = True;
		Items.AdvanceClearingAmountCur.Visible = False;
	Else
		Items.ExchangeRate.ReadOnly = False;
		Items.Multiplier.ReadOnly = False;
		Items.AdvanceClearingAmountCur.Visible = True;
		Items.AdvanceClearingAmountCur.Title = StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = 'Amount (%1)'; tr = 'Tutar (%1)'"),
				Object.Currency);
	EndIf;
	
	SubjectToVAT = Not Object.ExemptFromVAT;
	
	Items.InventoryVATRate.Visible		= SubjectToVAT;
	Items.InventoryVATAmount.Visible	= SubjectToVAT;
	Items.InventoryTotal.Visible		= SubjectToVAT;
	Items.TotalVATAmount.Visible		= SubjectToVAT;
	Items.TotalTotal.Visible			= SubjectToVAT;
	
#If MobileClient Then
	CommonClientServer.SetFormItemProperty(Items, "GroupTotal", "Title", NStr("en = 'Totals'; tr = 'Toplamlar'"));
	CommonClientServer.SetFormItemProperty(Items, "GroupTotal", "Behavior", UsualGroupBehavior.Collapsible);
	CommonClientServer.SetFormItemProperty(Items, "GroupTotal", "ShowTitle", True);
	CommonClientServer.SetFormItemProperty(Items, "GroupTotal", "ControlRepresentation", UsualGroupControlRepresentation.TitleHyperlink);
	Items.GroupTotal.Hide();
	
	Items.InventoryImportInventoryFromFile.Visible = False;
#EndIf

EndProcedure

&AtClient
Procedure SelectAdvancesOnClose(Result, AdditionalParameters) Export
	
	If Result = DialogReturnCode.OK Then
		AddressInStorage = AdditionalParameters.AddressInStorage;
		GetAdvanceClearingFromStorage(AddressInStorage);
		Modified = True;
	EndIf;
	
EndProcedure

&AtServer
Function PutAdvanceClearingToStorage()
	
	Return PutToTempStorage(Object.AdvanceClearing.Unload(), UUID);
	
EndFunction

&AtServer
Procedure GetAdvanceClearingFromStorage(AddressInStorage)
	
	AdvanceTable = GetFromTempStorage(AddressInStorage);
	Object.AdvanceClearing.Load(AdvanceTable);
	
EndProcedure

&AtServer
Procedure FillVATRateByVATExemption()
	
	If Object.ExemptFromVAT Then
		
		ExemptFromVATRate = Catalogs.VATRates.GetExemptFromVATRate();
		
		For Each InventoryRow In Object.Inventory Do
			InventoryRow.VATRate = ExemptFromVATRate;
			InventoryRow.VATAmount = 0;
			InventoryRow.Total = InventoryRow.Amount;
		EndDo;
	Else
		For Each InventoryRow In Object.Inventory Do
			InventoryRow.VATRate = InventoryRow.Product.VATRate;
			InventoryTabularSectionClientServer.CalculateVATAmountAndTotal(InventoryRow);
		EndDo;
	EndIf;
	
EndProcedure

// StandardSubsystems.Properties
&AtClient
Procedure UpdateAdditionalAttributesDependencies()
	PropertyManagerClient.UpdateAdditionalAttributesDependencies(ThisObject);
EndProcedure

&AtClient
Procedure Attachable_OnChangeAdditionalAttribute(Item)
	PropertyManagerClient.UpdateAdditionalAttributesDependencies(ThisObject);
EndProcedure

&AtServer
Procedure UpdateAdditionalAttributesItems()
	PropertyManager.UpdateAdditionalAttributesItems(ThisObject);
EndProcedure
// End StandardSubsystems.Properties

// StandardSubsystems.ImportDataFromFile

&AtClient
Procedure ImportInventoryFromFileEnd(ImportedDataAddress, AdditionalParameters) Export
	
	If ImportedDataAddress = Undefined Then
		Return;
	EndIf;
	
	ImportInventoryFromFileAtServer(ImportedDataAddress);
	
EndProcedure

&AtServer
Procedure ImportInventoryFromFileAtServer(ImportedDataAddress)
	
	ImportedData = GetFromTempStorage(ImportedDataAddress);
	
	For Each TableRow In ImportedData Do
		
		If Not ValueIsFilled(TableRow.Product) Then 
			Continue;
		EndIf;
		
		NewRow = Object.Inventory.Add();
		NewRow.Product = TableRow.Product;
		NewRow.Quantity = TableRow.Quantity;
		NewRow.Price = TableRow.Price;
		NewRow.VATRate = TableRow.VATRate;
		
		InventoryTabularSectionClientServer.CalculateAmount(NewRow);
		
		Modified = True;
		
	EndDo;
	
EndProcedure

// End StandardSubsystems.ImportDataFromFile

#EndRegion
